In [1]:
import pandas as pd
import datetime as dt

In [2]:
df = pd.read_excel('C:/Users/davist/Documents/coding projects/Daily Exercises/New Members from 2018-19 to May 2022.xlsx')

C:\Users\davist\Anaconda3\lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [3]:
df

        Member ID Original Admit Date
0           85134          2020-09-15
1          228917          2020-06-20
2          247949          2018-10-11
3          247950          2018-10-11
4          260984          2019-04-03
...           ...                 ...
510668   11428093          2022-04-11
510669   11428096          2022-05-06
510670   11428097          2022-05-01
510671   11428099          2022-05-10
510672   11428100          2022-05-01

[510673 rows x 2 columns]

In [4]:
pd.to_datetime(df['Original Admit Date'])

0        2020-09-15
1        2020-06-20
2        2018-10-11
3        2018-10-11
4        2019-04-03
            ...
510668   2022-04-11
510669   2022-05-06
510670   2022-05-01
510671   2022-05-10
510672   2022-05-01
Name: Original Admit Date, Length: 510673, dtype: datetime64[ns]

In [5]:
df['month']=pd.to_datetime(df['Original Admit Date']).dt.month

In [6]:
df['year']=pd.to_datetime(df['Original Admit Date']).dt.year

In [12]:
df['Rotary Year']=''
df.loc[df['month']<7, 'Rotary Year']=(df['year']-1).astype(str)+'-'+df['year'].astype(str)
df.loc[df['month']>=7, 'Rotary Year']=df['year'].astype(str)+'-'+(df['year']+1).astype(str)

In [13]:
df

        Member ID Original Admit Date  month  year Rotary Year         ry
0           85134          2020-09-15      9  2020   2020-2021  2020-2021
1          228917          2020-06-20      6  2020   2019-2020  2019-2020
2          247949          2018-10-11     10  2018   2018-2019  2018-2019
3          247950          2018-10-11     10  2018   2018-2019  2018-2019
4          260984          2019-04-03      4  2019   2018-2019  2018-2019
...           ...                 ...    ...   ...         ...        ...
510668   11428093          2022-04-11      4  2022   2021-2022  2021-2022
510669   11428096          2022-05-06      5  2022   2021-2022  2021-2022
510670   11428097          2022-05-01      5  2022   2021-2022  2021-2022
510671   11428099          2022-05-10      5  2022   2021-2022  2021-2022
510672   11428100          2022-05-01      5  2022   2021-2022  2021-2022

[510673 rows x 6 columns]

In [14]:
additions = df[['Rotary Year','Member ID']].groupby(['Rotary Year']).count()

In [15]:
additions.rename(columns = {'Member ID':'Count'}, inplace = True)

In [16]:
additions

              Count
Rotary Year
2018-2019    140761
2019-2020    129676
2020-2021    120917
2021-2022    119319